// 1.Логічні порівняння та alert:

// Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.
// Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.

let number1 = 20;
let number2 = 20;

let compareResult =`Значення number1 і number2 однакові: ${number1 === number2}`;

// alert(compareResult);

// 2.Метод вводу інформації та логічні порівняння:

// Використовуючи prompt, запросіть у користувача введення числа.
// Перевірте, чи введене число парне чи непарне.
// Виведіть результат з використанням console.log.

let userNumber = Number(prompt('Напишіть число'));
let checkNumber = `Це число є парне: ${userNumber%2 === 0}`;
console.log(checkNumber);

// 3. логічні порівняння та введення-виведення:

// Використовуючи prompt, запитайте у користувача його вік.
// Перевірте, чи вік менше 18 років.
// Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс.

let userAge = Number(prompt('Напишіть свій вік'));
let userInfo = `У користувача є доступ до інформації бо його вік 18+ ${userAge>=18}`;
console.log(userInfo);


// 4. Розрахунок вартості товару та console.log:

// Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .
// Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).
// Виведіть результат за допомогою console.log.


let productPrice = Number(prompt('Вкажіть ціну товару'));
let productQuante = Number(prompt('Вкажіть кількість товару'));

let totalPrice = productPrice*productQuante;
console.log(`сумарна вартість ${totalPrice}`);

// 5. Розрахунок знижки на товар та alert:

// Використовуючи prompt, запросіть в користувача вартість товару.
// Розрахуйте знижку на товар у розмірі 50% від введеної вартості.
// Виведіть результат знижки за допомогою alert.

let oldPrice = Number(prompt('Вкажіть початкову ціну'));
let discount = oldPrice*0.5; // oldPrice/100 *50;
let finalPrice = oldPrice-discount;
alert(`Сума до сплати ${finalPrice}`);
